# 課題1: データセット「mobile-price-classfication」は携帯電話の端末ごとの情報と価格ランク（price_range）が記録されている。
#
# このデータを元に、価格ランク（price_range）を予測するモデルを構築せよ。
#
# 【データ】
#
# - train.csv
#   - 学習用のデータ
#   - 携帯電話、スマートフォン各機種のスペックと価格ランク（price_range）が記録されたデータ。価格ランクは0~3の4段階ある。
# - test.csv
#   - 精度検証用のデータ
#   - train.csvと同じカラム構成。test.csvに格納されている「price_range」を正とした予測結果を算出すること。
#
# 【提出要件】
#
# 以下の項目をJupyter Notebook上で出力した状態で提出すること
#
# - 予測結果と実際のランクによる混合行列
# - 予測において最も重要と考えられる変数Top5を列挙

# 以下よりコードを記入してください  ##############################


