# 課題3: データセット「new-york-city-taxi-fare-prediction」はニューヨーク州のタクシー乗車履歴を記録したものである。
#
# このデータを元に、タクシーの運賃価格（fare_amount）を予測するモデルを構築せよ。
#
# 【データ】
#
# - train.csv
#   - 学習用のデータ
#   - 予測対象のカラムである「fare_amount」と客が乗車した時間、緯度経度などの情報が記録されている。
#
# - test.csv
#   - 精度検証用のデータ
#   - train.csvと同じカラム構成。test.csvに格納されている「fare_amount」を正とした予測結果を算出すること。
#
# 【提出要件】
#
# 以下の項目をJupyter Notebook上で出力した状態で提出すること
#
# - データ前処理の過程（どういう処理をしたのかをコメント交えながら記載すること）
#
# - 予測精度を算出せよ（RMSE）

# 以下よりコードを記入してください  ##############################


